backend/app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "切符を買う"], ["description", "緑の窓口で買う"], ["completed", nil], ["created_at", "2025-05-06 04:44:58.199648"], ["updated_at", "2025-05-06 04:44:58.199648"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", ""], ["updated_at", "2025-05-06 07:07:30.255802"], ["id", 6]]

  def destroy
    @todo.destroy!
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]